geosmall/Arduino_Core_STM32/cores/arduino/sys/system.cpp
#ifndef UNIT_TEST // for unit tests, a dummy implementation is provided below
#include <stm32h7xx_hal.h>
#include <stm32yyxx.h>
#include "sys/system.h"
#include "sys/dma.h"
#include "per/gpio.h"
#include "per/rng.h"

// global init functions for peripheral drivers.
extern "C"
{
    extern void SystemClock_Config(uint32_t plln_val, uint32_t FLatency); // in Variant folder 
    extern void dsy_i2c_global_init();
    extern void dsy_spi_global_init();
    extern void dsy_uart_global_init();
}

// boot info struct declared in persistent backup SRAM
volatile daisy::System::BootInfo __attribute__((section(".backup_sram")))
daisy::boot_info;

// Jump related stuff
#define u32 uint32_t
#define vu32 volatile uint32_t
#define SET_REG(addr, val)    \
    do                        \
    {                         \
        *(vu32*)(addr) = val; \
    } while(0)

#define GET_REG(addr) (*(vu32*)(addr))
#define RCC_CR RCC
#define RCC_CFGR (RCC + 0x04)
#define RCC_CIR (RCC + 0x08)
#define RCC_AHBENR (RCC + 0x14)
#define RCC_APB2ENR (RCC + 0x18)
#define RCC_APB1ENR (RCC + 0x1C)

#define SCS 0xE000E000
#define STK (SCS + 0x10)
#define STK_CTRL (STK + 0x00)
#define RCC_CR RCC

#define SDRAM_BASE 0xC0000000

#define INTERNAL_FLASH_SIZE 0x20000
#define ITCMRAM_SIZE 0x10000
#define DTCMRAM_SIZE 0x20000
#define SRAM_D1_SIZE 0x80000
#define SRAM_D2_SIZE 0x48000
#define SRAM_D3_SIZE 0x10000
#define SDRAM_SIZE 0x4000000
#define QSPI_SIZE 0x800000

typedef struct
{
    vu32 ISER[2];
    u32  RESERVED0[30];
    vu32 ICER[2];
    u32  RSERVED1[30];
    vu32 ISPR[2];
    u32  RESERVED2[30];
    vu32 ICPR[2];
    u32  RESERVED3[30];
    vu32 IABR[2];
    u32  RESERVED4[62];
    vu32 IPR[15];
} NVIC_TypeDef;

__attribute__((always_inline)) static inline void __JUMPTOQSPI()
{
    __asm("LDR R1, =0xE000ED00;"); // SCB
    __asm("LDR R0, =0x90000000;"); // APP BASE
    __asm("STR R0, [R1, #8]");     // VTOR
    __asm("LDR SP, [R0, #0]");     // SP @ +0
    __asm("LDR R0, [R0, #4]");     // PC @ +4
    __asm("BX R0");
}

typedef void (*EntryPoint)(void);

// System Level C functions and IRQ Handlers
extern "C"
{
    void SysTick_Handler(void)
    {
        HAL_IncTick();
        HAL_SYSTICK_IRQHandler();
    }

    /** USB IRQ Handlers since they are shared resources for multiple classes */
    extern HCD_HandleTypeDef hhcd_USB_OTG_HS;
    extern PCD_HandleTypeDef hpcd_USB_OTG_HS;

    void OTG_HS_EP1_OUT_IRQHandler(void)
    {
        // if(hhcd_USB_OTG_HS.Instance)
        //     HAL_HCD_IRQHandler(&hhcd_USB_OTG_HS);
        if(hpcd_USB_OTG_HS.Instance)
            HAL_PCD_IRQHandler(&hpcd_USB_OTG_HS);
    }

    void OTG_HS_EP1_IN_IRQHandler(void)
    {
        // if(hhcd_USB_OTG_HS.Instance)
        //     HAL_HCD_IRQHandler(&hhcd_USB_OTG_HS);
        if(hpcd_USB_OTG_HS.Instance)
            HAL_PCD_IRQHandler(&hpcd_USB_OTG_HS);
    }

    void OTG_HS_IRQHandler(void)
    {
        // if(hhcd_USB_OTG_HS.Instance)
        //     HAL_HCD_IRQHandler(&hhcd_USB_OTG_HS);
        if(hpcd_USB_OTG_HS.Instance)
            HAL_PCD_IRQHandler(&hpcd_USB_OTG_HS);
    }

    // TODO: Add some real handling to the HardFaultHandler
    void HardFault_Handler()
    {
        // Grab an instance of the SCB so we can `p/x *scb` from the debugger
        SCB_Type* scb = SCB;
        (void)(scb);

        // Identify hardfault type
        if(SCB->HFSR & SCB_HFSR_FORCED_Msk)
        {
            // Forced hardfault

            // Copy faults for easy debugging
            size_t mmu_fault = (SCB->CFSR >> 0) & 0xFF;
            (void)(mmu_fault);
            size_t bus_fault = (SCB->CFSR >> 8) & 0xFF;
            (void)(bus_fault);
            size_t usage_fault = (SCB->CFSR >> 16) & 0xFFFF;
            (void)(usage_fault);

            // Check for memory manger faults
            if(SCB->CFSR & SCB_CFSR_MMARVALID_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_MLSPERR_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_MSTKERR_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_MUNSTKERR_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_DACCVIOL_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_IACCVIOL_Msk)
                __asm("BKPT #0");

            // Check for bus faults
            if(SCB->CFSR & SCB_CFSR_BFARVALID_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_LSPERR_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_STKERR_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_UNSTKERR_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_IMPRECISERR_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_PRECISERR_Msk)
                __asm("BKPT #0");
            if(SCB->CFSR & SCB_CFSR_IBUSERR_Msk)
                __asm("BKPT #0");

            // Check for usage faults
            if(SCB->CFSR & SCB_CFSR_DIVBYZERO_Msk)
                __asm("BKPT 0");
            if(SCB->CFSR & SCB_CFSR_UNALIGNED_Msk)
                __asm("BKPT 0");
            if(SCB->CFSR & SCB_CFSR_NOCP_Msk)
                __asm("BKPT 0");
            if(SCB->CFSR & SCB_CFSR_INVPC_Msk)
                __asm("BKPT 0");
            if(SCB->CFSR & SCB_CFSR_INVSTATE_Msk)
                __asm("BKPT 0");
            if(SCB->CFSR & SCB_CFSR_UNDEFINSTR_Msk)
                __asm("BKPT 0");

            __asm("BKPT #0");
        }
        else if(SCB->HFSR & SCB_HFSR_VECTTBL_Msk)
        {
            // Vector table bus fault

            __asm("BKPT #0");
        }

        __asm("BKPT #0");
        while(1)
            ;
    }
}

namespace daisy
{
// Define static tim_
TimerHandle System::tim_;

void System::Init()
{
    System::Config cfg;
    cfg.Defaults();
    Init(cfg);
}

// TODO: DONT FORGET TO IMPLEMENT CLOCK CONFIG
void System::Init(const System::Config& config)
{
    cfg_ = config;
    HAL_Init();
    if(!config.skip_clocks)
    {
        ConfigureClocks();
        ConfigureMpu();
    }
    dsy_dma_init();
    dsy_i2c_global_init();
    dsy_spi_global_init();
    dsy_uart_global_init();

