geosmall/Arduino_Core_STM32/cores/arduino/sys/system.cpp
    // Initialize Caches
    if(config.use_dcache)
        SCB_EnableDCache();
    if(config.use_icache)
        SCB_EnableICache();

    // Configure and start highspeed timer.
    // TIM 2 counter UP (defaults to fastest tick/longest period).
    TimerHandle::Config timcfg;
    timcfg.periph = TimerHandle::Config::Peripheral::TIM_2;
    timcfg.dir    = TimerHandle::Config::CounterDir::UP;
    tim_.Init(timcfg);
    tim_.Start();

    // Initialize the true random number generator
    Random::Init();
}

void System::DeInit()
{
    dsy_dma_deinit();
    // HAL_MPU_Disable();
    // The I2C global init doesn't actually initialize the periph,
    // so no need to deinitialize
    SCB_DisableDCache();
    SCB_DisableICache();

    tim_.DeInit();
    // HAL_RCC_DeInit();

    // WARNING -- without modifications, this function will
    // cause the device to reset, preventing program loading
    // HAL_DeInit();
}

void System::JumpToQspi()
{
    __JUMPTOQSPI();
    while(1) {}
}

uint32_t System::GetNow()
{
    return HAL_GetTick();
}

uint32_t System::GetUs()
{
    return tim_.GetUs();
}

uint32_t System::GetTick()
{
    return tim_.GetTick();
}

void System::Delay(uint32_t delay_ms)
{
    HAL_Delay(delay_ms);
}

void System::DelayUs(uint32_t delay_us)
{
    tim_.DelayUs(delay_us);
}

void System::DelayTicks(uint32_t delay_ticks)
{
    tim_.DelayTick(delay_ticks);
}

void System::ResetToBootloader(BootloaderMode mode)
{
    if(mode == BootloaderMode::STM)
    {
        // Initialize Boot Pin
        dsy_gpio_pin bootpin = {DSY_GPIOG, 3};
        dsy_gpio     pin;
        pin.mode = DSY_GPIO_MODE_OUTPUT_PP;
        pin.pin  = bootpin;
        dsy_gpio_init(&pin);

        // Pull Pin HIGH
        dsy_gpio_write(&pin, 1);

        // wait a few ms for cap to charge
        HAL_Delay(10);
    }
    else if(mode == BootloaderMode::DAISY
            || mode == BootloaderMode::DAISY_SKIP_TIMEOUT
            || mode == BootloaderMode::DAISY_INFINITE_TIMEOUT)
    {
        auto region = GetProgramMemoryRegion();
        if(region == MemoryRegion::INTERNAL_FLASH)
            return; // Cannot return to Daisy bootloader if it's not present!

        // Coming from a bootloaded program, the backup SRAM will already
        // be initialized. If the bootloader is <= v5, then it will not
        // be initialized, but a failed write will not cause a fault.
        switch(mode)
        {
            case BootloaderMode::DAISY_SKIP_TIMEOUT:
                boot_info.status = BootInfo::Type::SKIP_TIMEOUT;
                break;
            case BootloaderMode::DAISY_INFINITE_TIMEOUT:
                boot_info.status = BootInfo::Type::INF_TIMEOUT;
                break;
            default:
                // this is technically valid, just means no
                // special behavior applied on boot
                boot_info.status = BootInfo::Type::INVALID;
                break;
        }
    }
    else
    {
        return; // Malformed mode
    }

    // disable interupts
    RCC->CIER = 0x00000000;

    // Software Reset
    HAL_NVIC_SystemReset();
}

void System::InitBackupSram()
{
    PWR->CR1 |= PWR_CR1_DBP;
    while((PWR->CR1 & PWR_CR1_DBP) == RESET)
        ;
    __HAL_RCC_BKPRAM_CLK_ENABLE();
}

System::BootInfo::Version System::GetBootloaderVersion()
{
    auto region = GetProgramMemoryRegion();
    if(region == MemoryRegion::INTERNAL_FLASH)
        return BootInfo::Version::NONE;

    for(int i = 0; i < (int)BootInfo::Version::LAST; i++)
    {
        if(boot_info.version == (BootInfo::Version)i)
            return (BootInfo::Version)i;
    }

    // Otherwise, the version may be higher than this
    // version of the library knows about. In that case,
    // expecting backwards compatibility, we'll say it's
    // at least the latest version.
    return (BootInfo::Version)((int)BootInfo::Version::LAST - 1);
}

#if 0 // gls

static void Error_Handler()
{
    // Insert code to handle errors here.
    while(1) {}
}

void System::ConfigureClocks()
{

#if !defined(HSE_VALUE)
#error "HSE_VALUE not defined in system.cpp"
#endif

#if (HSE_VALUE != 16000000) && (HSE_VALUE != 25000000)
#error "Unsupported HSE_VALUE"
#endif

    RCC_OscInitTypeDef       RCC_OscInitStruct   = {0};
    RCC_ClkInitTypeDef       RCC_ClkInitStruct   = {0};
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

    /** Supply configuration update enable
  */
    HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

    /** Configure the main internal regulator output voltage
     ** and set PLLN value, and flash-latency.
     **
     ** See page 159 of Reference manual for VOS/Freq relationship
     ** and table for flash latency.
     */

    uint32_t plln_val, flash_latency;
    switch(cfg_.cpu_freq)
    {
        case Config::SysClkFreq::FREQ_480MHZ:
            __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);
            plln_val      = 240;
            flash_latency = FLASH_LATENCY_4;
            break;
        case Config::SysClkFreq::FREQ_400MHZ:
        default:
            __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
            plln_val      = 200;
            flash_latency = FLASH_LATENCY_2;
            break;
    }

    while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}
    /** Macro to configure the PLL clock source
  */
    __HAL_RCC_PLL_PLLSOURCE_CONFIG(RCC_PLLSOURCE_HSE);
    /** Initializes the CPU, AHB and APB busses clocks
  */
    RCC_OscInitStruct.OscillatorType
        = RCC_OSCILLATORTYPE_HSI48 | RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState      = RCC_HSE_ON;
    RCC_OscInitStruct.HSI48State    = RCC_HSI48_ON;
    RCC_OscInitStruct.PLL.PLLState  = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM      = 4;
    //
    RCC_OscInitStruct.PLL.PLLN      = plln_val;
    RCC_OscInitStruct.PLL.PLLP      = 2;
    RCC_OscInitStruct.PLL.PLLQ      = 5; // was 4 in cube
    RCC_OscInitStruct.PLL.PLLR      = 2;
    RCC_OscInitStruct.PLL.PLLRGE    = RCC_PLL1VCIRANGE_2;
    RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
    RCC_OscInitStruct.PLL.PLLFRACN  = 0;
    if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }
    /** Initializes the CPU, AHB and APB busses clocks
  */
    RCC_ClkInitStruct.ClockType
        = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1
          | RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_D3PCLK1 | RCC_CLOCKTYPE_D1PCLK1;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.SYSCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
    RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

    if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency) != HAL_OK)
    {
        Error_Handler();
    }
    PeriphClkInitStruct.PeriphClockSelection
        = RCC_PERIPHCLK_USART1 | RCC_PERIPHCLK_USART6
          | RCC_PERIPHCLK_USART234578 | RCC_PERIPHCLK_LPUART1
          | RCC_PERIPHCLK_RNG | RCC_PERIPHCLK_SPI1 | RCC_PERIPHCLK_SAI2
          | RCC_PERIPHCLK_SAI1 | RCC_PERIPHCLK_SDMMC | RCC_PERIPHCLK_I2C2
          | RCC_PERIPHCLK_ADC | RCC_PERIPHCLK_I2C1 | RCC_PERIPHCLK_USB
          | RCC_PERIPHCLK_QSPI | RCC_PERIPHCLK_FMC;
    // PLL 2
    //  PeriphClkInitStruct.PLL2.PLL2N = 115; // Max Freq @ 3v3
    //PeriphClkInitStruct.PLL2.PLL2N      = 84; // Max Freq @ 1V9
    /** Old Timing  */
    /*
    PeriphClkInitStruct.PLL2.PLL2N      = 100; // Max supported freq of FMC;
    PeriphClkInitStruct.PLL2.PLL2M      = 4;
    PeriphClkInitStruct.PLL2.PLL2P      = 8;  // 57.5
    PeriphClkInitStruct.PLL2.PLL2Q      = 10; // 46
    PeriphClkInitStruct.PLL2.PLL2R      = 2;  // 115Mhz
    PeriphClkInitStruct.PLL2.PLL2FRACN  = 0;
    */

    // New Timing
    PeriphClkInitStruct.PLL2.PLL2N     = 12; // Max supported freq of FMC;
    PeriphClkInitStruct.PLL2.PLL2M     = 1;
    PeriphClkInitStruct.PLL2.PLL2P     = 8; // 25MHz
    PeriphClkInitStruct.PLL2.PLL2Q     = 2; // 100MHz
    PeriphClkInitStruct.PLL2.PLL2R     = 1; // 200MHz
    PeriphClkInitStruct.PLL2.PLL2FRACN = 4096;


    PeriphClkInitStruct.PLL2.PLL2RGE    = RCC_PLL2VCIRANGE_2;
    PeriphClkInitStruct.PLL2.PLL2VCOSEL = RCC_PLL2VCOWIDE;
    // PLL 3
    PeriphClkInitStruct.PLL3.PLL3M         = 6;
    PeriphClkInitStruct.PLL3.PLL3N         = 295;
    PeriphClkInitStruct.PLL3.PLL3P         = 16; // 49.xMhz
    PeriphClkInitStruct.PLL3.PLL3Q         = 4;
    PeriphClkInitStruct.PLL3.PLL3R         = 32; // 24.xMhz
    PeriphClkInitStruct.PLL3.PLL3RGE       = RCC_PLL3VCIRANGE_1;
    PeriphClkInitStruct.PLL3.PLL3VCOSEL    = RCC_PLL3VCOWIDE;
    PeriphClkInitStruct.PLL3.PLL3FRACN     = 0;
    PeriphClkInitStruct.FmcClockSelection  = RCC_FMCCLKSOURCE_PLL2;
    PeriphClkInitStruct.QspiClockSelection = RCC_QSPICLKSOURCE_D1HCLK;
    //PeriphClkInitStruct.SdmmcClockSelection  = RCC_SDMMCCLKSOURCE_PLL;
    PeriphClkInitStruct.SdmmcClockSelection  = RCC_SDMMCCLKSOURCE_PLL2;
    PeriphClkInitStruct.Sai1ClockSelection   = RCC_SAI1CLKSOURCE_PLL3;
    PeriphClkInitStruct.Sai23ClockSelection  = RCC_SAI23CLKSOURCE_PLL3;
    PeriphClkInitStruct.Spi123ClockSelection = RCC_SPI123CLKSOURCE_PLL2;
    PeriphClkInitStruct.Usart234578ClockSelection
        = RCC_USART234578CLKSOURCE_D2PCLK1;
    PeriphClkInitStruct.Usart16ClockSelection = RCC_USART16CLKSOURCE_D2PCLK2;
    PeriphClkInitStruct.I2c123ClockSelection  = RCC_I2C123CLKSOURCE_D2PCLK1;
    PeriphClkInitStruct.I2c4ClockSelection    = RCC_I2C4CLKSOURCE_PLL3;
    PeriphClkInitStruct.UsbClockSelection     = RCC_USBCLKSOURCE_HSI48;
    PeriphClkInitStruct.AdcClockSelection     = RCC_ADCCLKSOURCE_PLL3;
    if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /** Enable USB Voltage detector */
    HAL_PWREx_EnableUSBVoltageDetector();
}

